---
kind: type
id: T:Autodesk.Revit.DB.ExternalResourceMatchOptions
source: html/d13299cb-1886-2efe-6d97-1e4f7b73043e.htm
---
# Autodesk.Revit.DB.ExternalResourceMatchOptions

Represents match options used to filter external resources when listing them from external resource server.

## Syntax (C#)
```csharp
public class ExternalResourceMatchOptions : IDisposable
```